#### 2024.9.16

**今日学习：
（65）清洗数据内容·脏（66）清洗数据·保存干净数据**

In [1]:
import pandas as pd

#### 一、清洗数据·脏数据

**（1）数据内容·分类:**

        根据数据的内容划分为 脏数据&干净数据

**（2）对整列缺失值进行填充:**

        若想填入一个统一值，则可针对列的赋值操作直接搞定

In [2]:
s_name = pd.Series(["沃玛", "憨色", "冷鸟", "吴优"], index=["01", "02", "03", "04"])
s_sex = pd.Series(["女", "女", "女", "男"], index=["01", "02", "03", "04"])
s_height = pd.Series([160.0, 158.5, 162.2, 172.5], index=["01", "02", "03", "04"])
s_grade = pd.Series([100, 90, 80, 66], index=["01", "02", "03", "04"])

df_1 = pd.DataFrame({"姓名":s_name, "性别":s_sex, "身高":s_height, "成绩":s_grade, "国家":""})
df_1

    姓名 性别     身高   成绩 国家
01  沃玛  女  160.0  100
02  憨色  女  158.5   90
03  冷鸟  女  162.2   80
04  吴优  男  172.5   66

In [3]:
df_1["国家"] = "中国"
df_1

    姓名 性别     身高   成绩  国家
01  沃玛  女  160.0  100  中国
02  憨色  女  158.5   90  中国
03  冷鸟  女  162.2   80  中国
04  吴优  男  172.5   66  中国

**（3）对某个缺失值进行填充:**

        使用loc或iloc先去定位到那个值----loc()根据标签位置

In [4]:
df_1.loc["02", "成绩"] = 95    # df_1.loc["标签索引 ", "列名 "]
df_1

    姓名 性别     身高   成绩  国家
01  沃玛  女  160.0  100  中国
02  憨色  女  158.5   95  中国
03  冷鸟  女  162.2   80  中国
04  吴优  男  172.5   66  中国

**（4）对部分缺失值进行填充:**

        也是使用loc或iloc提取那一部分----.loc["起点行 ":"终点行 ", "列名 "]

In [5]:
df_1.loc["03":"04", "成绩"] = [90, 80]    # df_1.loc["起点·序列 ":"终点·序列 ", "列名 "]
df_1

    姓名 性别     身高   成绩  国家
01  沃玛  女  160.0  100  中国
02  憨色  女  158.5   95  中国
03  冷鸟  女  162.2   90  中国
04  吴优  男  172.5   80  中国

**（5）自动找到缺失值进行填充:**

        调用.fillna()方法自动找到全部的NaN的值并进行填充----填充缺失值是None

In [6]:
s_name = pd.Series(["沃玛", "憨色", "冷鸟", "吴优"], index=["01", "02", "03", "04"])
s_sex = pd.Series(["女", "女", "女", "男"], index=["01", "02", "03", "04"])
s_height = pd.Series([160.0, 158.5, 162.2, 172.5], index=["01", "02", "03", "04"])
s_grade = pd.Series([100, 90, 80, 66], index=["01", "02", "03", "04"])
s_nation = pd.Series(["中国", None, None, None], index=["01", "02", "03", "04"])

df_2 = pd.DataFrame({"姓名":s_name, "性别":s_sex, "身高":s_height, "成绩":s_grade, "国家":s_nation})
df_2

    姓名 性别     身高   成绩    国家
01  沃玛  女  160.0  100    中国
02  憨色  女  158.5   90  None
03  冷鸟  女  162.2   80  None
04  吴优  男  172.5   66  None

In [7]:
df_2["国家"].fillna(111)    # 在"国家 "列中，通过调用fillna()将空缺值改为 111，便可知道空缺值在哪

01     中国
02    111
03    111
04    111
Name: 国家, dtype: object

        如果想在空缺值内填入并非提前知道的值，如填充成绩的平均值，则可根据df自定义填充内容

In [8]:
df_2["国家"].fillna(df_2["成绩"].mean())    # 此处将国家列填充为数字仅当测试使用

01      中国
02    84.0
03    84.0
04    84.0
Name: 国家, dtype: object

In [9]:
df_2    # 此类操作同样不会改变原始DataFrame----若想自动改变原始df，调用参数 inplace=True

    姓名 性别     身高   成绩    国家
01  沃玛  女  160.0  100    中国
02  憨色  女  158.5   90  None
03  冷鸟  女  162.2   80  None
04  吴优  男  172.5   66  None

df_2.fillna({"列1":2, "列2":3, "列3":4})    

即将列1中的缺失值改为2···以此类推

**（6）删除有缺失值的行:**

        调用.dropna()即删除存在缺失值的行----默认是axis=0，即删除有缺失值的行；删除列时即调用axis=1

In [10]:
df_2.dropna()    # 删除存在缺失值的行，只要任意列存在缺失值便删除

    姓名 性别     身高   成绩  国家
01  沃玛  女  160.0  100  中国

In [11]:
df_2.dropna(subset=["国家"])    # 调用subset=["列名 "]参数后，仅删除 "国家 "列中有缺失值的行

    姓名 性别     身高   成绩  国家
01  沃玛  女  160.0  100  中国

**（7）删除重复数据:**

        调用.drop_duplicates()删除重复数据----对于Series即删除重复值；对于DataFrame即删除全部值相同的行

In [12]:
df_2["性别"].drop_duplicates()    # 对Seires进行调用，仅返回了男女两个独特值----其中01、02、03都是"女"，但只保留第一个

01    女
04    男
Name: 性别, dtype: object

In [13]:
df_2.drop_duplicates()    # 没有行完全重复，因此不删除任何行

    姓名 性别     身高   成绩    国家
01  沃玛  女  160.0  100    中国
02  憨色  女  158.5   90  None
03  冷鸟  女  162.2   80  None
04  吴优  男  172.5   66  None

In [14]:
df_2.drop_duplicates(subset=["性别", "成绩"])    # 调用subset()参数删除 "性别 ", "成绩 " 两行数据完全重复的行----默认axis=0

    姓名 性别     身高   成绩    国家
01  沃玛  女  160.0  100    中国
02  憨色  女  158.5   90  None
03  冷鸟  女  162.2   80  None
04  吴优  男  172.5   66  None

        注意：正如尚文提到，出现重复行时，默认删除后者出现的重复值（即保留第一个）
             但也可以通过调用参数 keep="last" 保留最后一个重复值

**（8）对值进行替换:**

        调用.repalce("老值"，"新值")，将表达同一意思的"1班"替换为"一班"
           .repalce(["老值1", "老值2", "老值3"]，"新值")，即将列表中的值均替换为后值

           同时也可以传入一个字典，表明替换的值{1:2, 3:4, 5:6}

**（9）对值的类型进行转换:**

        因为例如求平均只能不能用于字符串数据类型等
        调用.astype(数据类型)

        注意：Pandas中存在一种数据类型，叫category，意思为分类数据
             数据可分为两种类型：1.分类数据：包含有限数量的不同类别的数据----如男女的性别，是有限的
                              2.数值数据：具体测量的数据，无限的----如0-1之间就有无限个数据

In [15]:
df_2["身高"].astype(float)    # 将身高列的数据转换为浮点数

01    160.0
02    158.5
03    162.2
04    172.5
Name: 身高, dtype: float64

In [16]:
type(df_2["身高"])    # 返回一个Series的type

pandas.core.series.Series

In [17]:
type(df_2["身高"][0])    # 返回具体一个元素的type

/var/folders/nm/k6xd7m5j5_n5tkt_d9xcbflh0000gn/T/ipykernel_74718/4099642616.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  type(df_2["身高"][0])    # 返回具体一个元素的type

numpy.float64

In [18]:
s_sex = pd.Series(["女", "男"])
s_sex.astype("category")    # 设定s_sex为分类数据----有利于后续pandas自动分析
                            #                      以及category数据类型不是python自带的，而是pandas库中的，因此需要加上""

0    女
1    男
dtype: category
Categories (2, object): ['女', '男']

=======================================================================================

#### 二、清洗数据·保存干净数据

**（1）保存清洗后数据:**

        在对数据进行清洗后，需要对干净数据进行保存，方便后续处理
        本质就是将清洗好后的DataFrame保存到一个新建的空白文件里
                之前介绍过通过调用pd.read_scv()方法来读取scv文件
                现在可以通过调用 df.to_csv("文件路径") 写入csv文件----便能将DataFrame保存到scv文件中，文件路径存在则覆盖，否则为新建

In [19]:
df_2

    姓名 性别     身高   成绩    国家
01  沃玛  女  160.0  100    中国
02  憨色  女  158.5   90  None
03  冷鸟  女  162.2   80  None
04  吴优  男  172.5   66  None

In [20]:
pd.read_csv("/Users/warma/Downloads/2024.09.16学习CSV文件.csv")    # 进行读取，发现第一列怪怪的
                                                                  # to_csv会将索引列进行保存，但read_csv读取时，pd不知道那个是索引

   Unnamed: 0  姓名 性别     身高
0           1  沃玛  女  160.0
1           2  憨色  女  158.5
2           3  冷鸟  女  162.2
3           4  吴优  男  172.5

In [21]:
df_2.to_csv("/Users/warma/Downloads/2024.09.16学习CSV文件1.csv")    # 已保存到下载文件夹中

In [22]:
df_3 = pd.read_csv("/Users/warma/Downloads/2024.09.16学习CSV文件1.csv")
df_3
# 读取刚刚保存的csv文件，但发现第一列怪怪的
# 因为无法识别第一列为索引，便将其作为第一列的数据
#     且该列无列名，便自动添加列名 "Unnamed: 0 "
#     to_csv默认保存索引是合理的，但索引有时并不是默认的位置索引，而是我们自定义的标签索引
#         因此可以调整将设定的标签索引重新变为一列，恢复默认的位置索引

   Unnamed: 0  姓名 性别     身高   成绩   国家
0           1  沃玛  女  160.0  100   中国
1           2  憨色  女  158.5   90  NaN
2           3  冷鸟  女  162.2   80  NaN
3           4  吴优  男  172.5   66  NaN

In [23]:
df_3.rename(columns={"Unnamed: 0":"ID"},inplace=True)
df_3

   ID  姓名 性别     身高   成绩   国家
0   1  沃玛  女  160.0  100   中国
1   2  憨色  女  158.5   90  NaN
2   3  冷鸟  女  162.2   80  NaN
3   4  吴优  男  172.5   66  NaN

In [24]:
df_2

    姓名 性别     身高   成绩    国家
01  沃玛  女  160.0  100    中国
02  憨色  女  158.5   90  None
03  冷鸟  女  162.2   80  None
04  吴优  男  172.5   66  None

In [25]:
df_2.to_csv("/Users/warma/Downloads/2024.09.16学习CSV文件2.csv", index=False)    # 通过调用 index=False 便可不保存索引
df_4 = pd.read_csv("/Users/warma/Downloads/2024.09.16学习CSV文件2.csv")          # 读取时自动返回默认的位置索引
df_4                                                                            # 一般索引是默认从0开始的默认索引时，需要调用index=False

   姓名 性别     身高   成绩   国家
0  沃玛  女  160.0  100   中国
1  憨色  女  158.5   90  NaN
2  冷鸟  女  162.2   80  NaN
3  吴优  男  172.5   66  NaN